<?php

namespace Database\Seeders;

use App\Models\Region;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class RegionsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $regions = [
            [
                'name' => [
                    'uk' => 'Одеська',
                    'ru' => 'Одесская',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Дніпропетровська',
                    'ru' => 'Днепропетровская',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Чернігівська',
                    'ru' => 'Черниговская',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Харківська',
                    'ru' => 'Харьковская',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Житомирська',
                    'ru' => 'Житомирская',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Полтавська',
                    'ru' => 'Полтавская',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Херсонська',
                    'ru' => 'Херсонская',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Київська',
                    'ru' => 'Киевская',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Запорізька',
                    'ru' => 'Запорожская',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Луганська',
                    'ru' => 'Луганская',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Донецька',
                    'ru' => 'Донецкая',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Вінницька',
                    'ru' => 'Винницкая',
                ],
            ],
//            [
//                'name' => [
//                    'uk' => 'Автономна Республіка Крим',
//                    'ru' => 'Автономная Республика Крым',
//                ],
//            ],
            [
                'name' => [
                    'uk' => 'Миколаївська',
                    'ru' => 'Николаевская',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Кіровоградська',
                    'ru' => 'Кировоградская',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Сумська',
                    'ru' => 'Сумская',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Львівська',
                    'ru' => 'Львовская',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Черкаська',
                    'ru' => 'Черкасская',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Хмельницька',
                    'ru' => 'Хмельницкая',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Волинська',
                    'ru' => 'Волынская',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Рівненська',
                    'ru' => 'Ровенская',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Івано-Франківська',
                    'ru' => 'Ивано-Франковская',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Тернопільська',
                    'ru' => 'Тернопольская',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Закарпатська',
                    'ru' => 'Закарпатская',
                ],
            ],
            [
                'name' => [
                    'uk' => 'Чернівецька',
                    'ru' => 'Черновицкая',
                ],
            ],
            [
                'name' => [
                    'uk' => 'м. Київ',
                    'ru' => 'г. Киев',
                ],
            ],
//            [
//                'name' => [
//                    'uk' => 'м. Севастополь',
//                    'ru' => 'г. Севастополь',
//                ],
//            ],
        ];

        foreach ($regions as $region) {
            Region::create($region);
        }
    }
}
